# AdjustEdgeTooShort Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..AnalyticalModelFailures..::..AdjustEdgeTooShort Property
BuiltInFailures..::..AnalyticalModelFailures Class See Also
---
AdjustEdge is too short.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId AdjustEdgeTooShort { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property AdjustEdgeTooShort As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ AdjustEdgeTooShort {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..AnalyticalModelFailures Class
Autodesk.Revit.DB Namespace